EDT/УТ/src/InformationRegisters/КонтактнаяИнформация/КонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтактнаяИнформация</name>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Поле1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле6</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле7</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле8</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле9</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле10</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипДома</name>
    <type>
      <types>EnumRef.ТипыДомов</types>
    </type>
  </resources>
  <resources>
    <name>ТипКорпуса</name>
    <type>
      <types>EnumRef.ТипыКорпусов</types>
    </type>
  </resources>
  <resources>
    <name>ТипКвартиры</name>
    <type>
      <types>EnumRef.ТипыКвартир</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.КонтактныеЛицаКонтрагентов</types>
      <types>CatalogRef.ЛичныеКонтакты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>Адрес</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Другое</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/InformationRegisters/КонтактнаяИнформация/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	Запись.Тип = ПолучитьТипЗаписиПоВиду(Запись.Вид);
КонецПроцедуры

&НаСервере
Функция ПолучитьТипЗаписиПоВиду(Вид)
	Если ТипЗнч(Вид) = Тип("Строка") Тогда
		Возврат Перечисления.ТипыКонтактнойИнформации.Другое;
	Иначе
		Возврат Вид.Тип;
	КонецЕсли;
КонецФункции
